### Q1

In [1]:
#A database is an organized collection of data that can be easily accessed and managed by a computer system.
#The SQL databases are relational, meaning they store the data in a table format.
#The NoSQL databases are non relational store the data in various formats uch as documents, key value pairs.

### Q2

In [3]:
#DDL stands for data defination language. DDL consists of commands that are used to create  the structure 
#of the table.

# CREATE - This command is used to create a table in a database.
#Ex: CREATE TABLE STUDENT( student_name varchar(50),roll_no int);
#This will create a table named student and there will be two columns named 'student_name' and 'roll_no'.

#DROP - This command is used to delete the table or object from the database.
#Ex: DROP TABLE STUDENT;
#This will delete the table named 'STUDENT' from the database.

#ALTER -This command is used to modify the table by adding or removing colums in the database.
#Ex: ALTER TABLE STUDENT ADD Email varchar(50);
#This will add the new column named 'Email' in the STUDENT table.

#TURNCATE - This command is used to remove all the data from a table, but not table itself.
#Ex: TRUNCATE TABLE Persons; 
#This delete all the rows from the Persons table, but keeps the table structure.

### Q3

In [4]:
# DML stands for Data Manupulation Language,it is used to insert, update and delete the table data. 

#INSERT - This command is used to insert the data into the table.
#Ex: INSERT INTO STUDENT(student_name,roll_no) values('Pratik Patil',47);
#It will add a row in the table with values 'Pratik Patil'and '47'.

#UPDATE - This command is used to update the values of existing rows.
#Ex: UPDATE STUDENT SET roll_no=10 WHERE student_name='Yash';
#It will find student named 'Yash' in the table where it will change the roll no and set it to 10.

#DELETE - This command is used to delete or remove the row from the table.
#Ex: DELETE FROM STUDENT WHERE roll_no<18;
#It will delete all the rows from the STUDENT table where the roll_no column is less than 18.

### Q4

In [2]:
#DQL stands for Data Query Language, which is use to retrive the data from the database.

#SELECT - This command is use to retrive whole or specific data from the table.
#Ex: SELECT * FROM STUDENT;
#It will show the whole 'STUDENT' table.

### Q5

In [ ]:
#A primary key is a column or a set of columns that uniquely identifies each row in a table.
#A primary key cannot have null or duplicate values.
#A foreign key is a column or a set of columns that references the primary key of another table.
#A foreign key establishes a relationship between two tables and ensures data integrity.

### Q6

In [4]:
import mysql.connector
mydb=mysql.connector.connect(
    host:'localhost',
    user:'abc',
    password:'password'
)

In [5]:
#The cursor() method is used to create a cursor object, which allows you to execute SQL queries on the 
#database.
#The execute() method is used to execute a single SQL query on the database. It takes a string argument 
#that contains the SQL statement.

### Q7

In [6]:
#The order of execution of SQL clauses in an SQL query is as follows:
#FROM
#WHERE
#GROUP BY
#HAVING
#SELECT
#DISTINCT
#ORDER BY
#LIMIT